
===========================================================================
report_tns
============================================================================
tns -14.18

===========================================================================
report_wns
============================================================================
wns -2.35

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -2.35

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.37
