
===========================================================================
report_tns
============================================================================
tns -10.45

===========================================================================
report_wns
============================================================================
wns -1.84

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -1.84

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.30
