
===========================================================================
report_tns
============================================================================
tns -86.42

===========================================================================
report_wns
============================================================================
wns -9.96

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -9.96

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.19
