
===========================================================================
report_tns
============================================================================
tns -89.89

===========================================================================
report_wns
============================================================================
wns -10.32

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -10.32

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.21
