
===========================================================================
report_tns
============================================================================
tns -16.86

===========================================================================
report_wns
============================================================================
wns -2.83

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -2.83

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.24
