# Load standard cell library
read_liberty -lib /home/jagadeesh97/OpenROAD-flow-scripts/flow/platforms/sky130hs/lib/sky130_fd_sc_hs__tt_025C_1v80.lib

# Read RTL Verilog
read_verilog baugh.v

# Synthesize top module
synth -top baugh 

# Prepare top module without flattening
prep -top baugh

# Map D flip-flops
# dfflibmap -liberty /home/jagadeesh97/OpenROAD-flow-scripts/flow/platforms/sky130hs/lib/sky130_fd_sc_hs__tt_025C_1v80.lib

# Then: map those gates into Sky130 cells (maj can’t reappear)
# abc -liberty /home/jagadeesh97/OpenROAD-flow-scripts/flow/platforms/sky130hs/lib/sky130_fd_sc_hs__tt_025C_1v80.lib

# Output mapped netlist
write_verilog baugh_unit.v
write_json baugh_unit.json