
===========================================================================
report_tns
============================================================================
tns -14.99

===========================================================================
report_wns
============================================================================
wns -2.64

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -2.64

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.23
