
===========================================================================
report_tns
============================================================================
tns -18.34

===========================================================================
report_wns
============================================================================
wns -2.86

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -2.86

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.15
