
===========================================================================
report_tns
============================================================================
tns -24.66

===========================================================================
report_wns
============================================================================
wns -2.95

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -2.95

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.13
